In [11]:
import pandas as pd

In [12]:
df=pd.read_json("data2.json")

In [13]:
df

     Name  Age  Gender  Class  Maths  Science  English
0    Amit   15    Male     10     85       78       88
1    Riya   14  Female      9     92       89       94
2   Karan   16    Male     10     67       72       65
3   Pooja   15  Female     10     75       80       79
4    Anil   14    Male      9     58       60       54
5   Sneha   16  Female     11     89       91       87
6   Rahul   15    Male     10     73       70       76
7   Divya   14  Female      9     95       92       98
8   Vikas   16    Male     11     55       49       60
9  Nikita   15  Female     10     88       85       90

In [26]:
# 1st problem find avg marks of each subject per class 
df.groupby("Class")[["Maths","Science","English"]].mean()

           Maths    Science  English
Class
9      81.666667  80.333333     82.0
10     77.600000  77.000000     79.6
11     72.000000  70.000000     73.5

In [27]:
#2nd problem which class has highest avg total marks
# add new column of total 
df["Total"]=df[["Maths","Science","English"]].sum(axis=1)

In [28]:
df

     Name  Age  Gender  Class  Maths  Science  English  Total
0    Amit   15    Male     10     85       78       88    251
1    Riya   14  Female      9     92       89       94    275
2   Karan   16    Male     10     67       72       65    204
3   Pooja   15  Female     10     75       80       79    234
4    Anil   14    Male      9     58       60       54    172
5   Sneha   16  Female     11     89       91       87    267
6   Rahul   15    Male     10     73       70       76    219
7   Divya   14  Female      9     95       92       98    285
8   Vikas   16    Male     11     55       49       60    164
9  Nikita   15  Female     10     88       85       90    263

In [31]:
# get the avg of total marks of per class
avg_total_class=df.groupby("Class")["Total"].mean()

In [32]:
avg_total_class

Class
9     244.0
10    234.2
11    215.5
Name: Total, dtype: float64

In [35]:
#get class with highest avg total marks
high_avg_total=avg_total_class.idxmax()

In [39]:
print(f"class with highest avg total marks is:{high_avg_total}")

class with highest avg total marks is 9